app/controllers/leads_controller.rb

INSERT INTO "leads" ("company", "created_at", "email", "first_name", "last_name", "phone", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @lead = current_user.leads.new(lead_params)
    set_salesforce_config

    respond_to do |format|
      if @lead.save

UPDATE "leads" SET "first_name" = $1, "updated_at" = $2 WHERE "leads"."id" = 9  [["first_name", "meu nome foi"], ["updated_at", "2014-10-13 18:25:52.298082"]]
---
  def update
    respond_to do |format|
      if @lead.update(lead_params)

DELETE FROM "leads" WHERE "leads"."id" = $1  [["id", 2]]
---
  def destroy
    destroy_on_salesforce
    @lead.destroy

SELECT  "leads".* FROM "leads"  WHERE "leads"."user_id" = $1 AND "leads"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 9]]
---
    def set_lead
      @lead = current_user.leads.find(params[:id])