app/controllers/salesforce_configurations_controller.rb

  def update
    if current_user.salesforce_configuration
      current_user.salesforce_configuration.update(salesforce_configuration_params)
---
UPDATE "salesforce_configurations" SET "security_token" = $1, "updated_at" = $2 WHERE "salesforce_configurations"."id" = 1  [["security_token", "dgyxDeAASL34qvDAW4gaP3ETb"], ["updated_at", "2014-10-13 22:48:08.973319"]]